       IDENTIFICATION DIVISION.
       PROGRAM-ID. GET-VOLUME-OF-CUBOID.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LENGTH-CUBE       PIC 9(3).
       01 WIDTH-CUBE        PIC 9(3).
       01 HEIGHT-CUBE       PIC 9(3).
       01 RESULT            PIC 9(8).
       PROCEDURE DIVISION USING 
       LENGTH-CUBE WIDTH-CUBE HEIGHT-CUBE RESULT.
       COMPUTE RESULT = LENGTH-CUBE*WIDTH-CUBE*HEIGHT-CUBE.
       END PROGRAM GET-VOLUME-OF-CUBOID.
